const Discord = require('discord.js');
const client = new Discord.Client();
 const prefix = "=";
client.on('ready', () => {
    console.log('I am ready!');
});


const N9e7h = [

'أعظم مصائب الجهل أن يجهل الجاهل جهله',
'الفضيلة والثروة ثقلان في كفتي ميزان لا يمكن أن يرتفع أحدهما دون أن ينخفض الآخر.' ,
'لصبر معطية يسير ببطء لكنه يوصل صاحبه لما يريد',
'من حفر حفرة لأخيه وقع فيها.',
'أغنى الصباح عن المصباح',
'دوام الفتن من أعظم المحن',
'القليل من التدبير أبقى من كثير من التبذير.',
' الكذب عار لازم وذل دائم.',
' جودة الكلام في الاختصار.',
' بركة المال في أداء الزكاة.',
' من عذب لسانه كثر إخوانه.',
' لا تكن ليناً فتعصر ولا صلباً فتكسر',
'الغرب ليسوا عباقة ونحن لسنا أغبياء، ھم فقط يدعمون الفاشل حتى ينجح، ونحن نحارب الناجح حتى يفشل',
'كالمستغيث من الرمضاء بالنار. ',
'الحكمة ضالة المؤمن. أكل عليه الدهر وشرب.',
' على الباغي تدور الدوائر.',
' خير الجيران عند الله خيرهم لجاره. ',
'من آمن بالآخرة لم يحرص على الدنيا. ',
'القناعة كنز لا يفنى. ',
'من اشتاق إلى الجنة سارع إلى الخيرات. ',
'بكاء المرء من خشية الله قرة عين. ',
'التائب من الذنب كمن لا ذنب له.',
' من حاسب نفسه ربح. ',
'من نظر في العواقب نجا.',
' من أضاع هواه ظل.',
' من لم يحلم ندم. ',
'من خاف رحم. ',
'من اعتبر صبر.',
'من فهم علم، ومن سعى وصل. ',
'من جد وجد، ومن زرع حصد. ',
'من غفل عن نفسه خسر،',
' ومن صبر غنم. ',
'لا تؤجل عمل اليوم إلى الغد.',
' إذا دعتك قدرتك إلى ظلم الناس فتذكر قدرة الله عليك.',
' إسأل مجرب ولا تسأل طبيب. ',
'كلام الرجل ميزان عقله. ',
'أول الغضب جنون وآخره ندم.',
' إذا كانت لك ذاكرة قوية... وذكريات مريرة... فأنت أشقى أهل الأرض.',
'لا يجب أن تقول كل ما تعرف... ولكن يجب أن تعرف كل ما تقول.',
' لا تبصق في البئر فقد تشرب منه يوماً.',
' ليس من الصعب أن تضحي من أجل صديق... ولكن من الصعب أن تجد الصديق الذي يستحق التضحية.',
' الحياة مليئة بالحجارة فلا تتعثر بها بل إجمعها وإبن بها سلماً به نحو النجاح.',
' إذا ركلك من خلفك... فإعلم أنك في المقدمة. ',
'حياتي التي أعيشها كالقهوة التي أشربها على كثر ما هي مرة فيها حلاوة.',
' الصداقة كالمظلة كلما إشتد المطر كلما إزدادت الحاجة لها. ',
(edited)
'كل شيء إذا كثر رخص إلّا الأدب فإنه إذا كثر غلا. ',
'كل شيء يبدأ صغيراً ثم يكبر إلا المصيبة فإنها تبدأ كبيرة ثم تصغر .',
]
client.on('message', message => {
    if (message.content.startsWith("=نصيحة")) {
        if (!message.channel.guild) return message.reply('** هاذا الأمر فقط للسيرفرات **');
        var client = new Discord.RichEmbed()
            .setTitle("نصائح ..")
            .setColor('RANDOM')
            .setDescription(`${N9e7h[Math.floor(Math.random() * N9e7h.length)]}`)
            .setImage("https://cdn.discordapp.com/attachments/431794394157416459/441210519953604608/N9e7h.png")
            .setTimestamp()

        message.channel.sendEmbed(client);
        message.react("??")
    }
});


client.login(process.env.BOT_TOKEN);
